// Написать функцию countOfSymbols, которая в качестве параметров принимает,
// какую-то строку и символ, а возвращает число вхождений этого символа в данную строку
// Например такой вызов написанной тобой функции countOfSymbols("Программирование", "м") вернет - 2
// Важно реализовать эту функцию не чувствительную к регистру (заглаваная/строчная буква)
// Типа вызов функции countOfSymbols("Программирование", "М") также должен вернуть - 2


const countOfSymbols = (str, char) => {
    // ЗДЕСЬ ТВОЙ КОД
}

module.exports = countOfSymbols