// Написать функцию rhombus, которая принимает в качестве параметра число n.
// А Возвращает двумерный массив состоящий из строк " " или "0", выводя который на экран, мы видели бы ромб
//
// Пример:
// n = 3
//
// Результат выполнения функции: [
//   [" ", "0", " "],
//   ["0", "0", "0"],
//   [" ", "0", " "]
// ]
//
// n = 5
//
// Результат выполнения функции: [
//   [" ", " ", "0", " ", " "],
//   [" ", "0", "0", "0", " "],
//   ["0", "0", "0", "0", "0"],
//   [" ", "0", "0", "0", " "],
//   [" ", " ", "0", " ", " "]
// ]
//
// n = 4
//
// Результат выполнения функции: [
//   [" ", "0", "0", " "],
//   ["0", "0", "0", "0"],
//   ["0", "0", "0", "0"],
//   [" ", "0", "0", " "],
// ]

const rhombus = (n) => {
  // ЗДЕСЬ ТВОЙ КОД
};

module.exports = rhombus;
