// Написать функцию rhombus, которая принимает в качестве параметра число n.
// А Возвращает двумерный массив состоящий из строк " " или "0", выводя который на экран, мы видели бы ромб
//
// Пример:
// n = 3
//
// Результат выполнения функции: [
//   [" ", "0", " "],
//   ["0", "0", "0"],
//   [" ", "0", " "]
// ]
//
// n = 5
//
// Результат выполнения функции: [
//   [" ", " ", "0", " ", " "],
//   [" ", "0", "0", "0", " "],
//   ["0", "0", "0", "0", "0"],
//   [" ", "0", "0", "0", " "],
//   [" ", " ", "0", " ", " "]
// ]
//
// n = 4
//
// Результат выполнения функции: [
//   [" ", "0", "0", " "],
//   ["0", "0", "0", "0"],
//   ["0", "0", "0", "0"],
//   [" ", "0", "0", " "],
// ]

const rhombus = (n) => {
  const result = [];
  const mid = Math.floor((n - 1) / 2); 

  for (let i = 0; i < n; i++) {
    const spaces = Math.abs(mid - i); 
    const zeros = n - 2 * spaces;   

    
    const row = [
      ...Array(spaces).fill(" "),    
      ...Array(zeros).fill("0"),     
      ...Array(spaces).fill(" ")    
    ];

    result.push(row);
  }

  return result;
};

module.exports = rhombus;
